[
  {
    "title": "Advanced JavaScript",
    "author": "Asim Hussain",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/133370_bfff_10.jpg",
    "authorDescription": "Over 17 years experience working for organisations such as the European Space Agency, Google and now Microsoft. Regular conference speaker and published author.\n\nWrote my first program in 1988, my first website in 1996, earned a 1st Class Degree in Computer Science in 2000 and now 18 years later I am a Cloud Developer Advocate for Microsoft, my job is to get developers excited about writing JavaScript applications on Azure, Microsofts cloud platform.\n\nThrough Udemy and my personal website I'm now also following my dream of teaching other passionate developers like myself what I know.",
    "originalPrice": 119.99,
    "discountedPrice": 99.99,
    "numOfRatings": 250,
    "rating": 4.9,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://img-c.udemycdn.com/course/480x270/405818_aa3f_3.jpg",
    "description": "Take your JavaScript skills to the next level with this advanced course. Learn how to build large-scale JavaScript applications.",
    "requirements": "A solid understanding of JavaScript programming and experience working with JavaScript.",
    "learningOutcomes": [
      "Understand advanced concepts in JavaScript such as closures, prototypes, and async programming",
      "Learn how to design and build large-scale JavaScript applications",
      "Gain experience working with common JavaScript libraries and frameworks",
      "Be able to optimize and debug JavaScript code"
    ]
  },
  {
    "title": "Advanced Web Design",
    "author": "Brad Hussey",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/422607_77b6_10.jpg",
    "authorDescription": "Brad Hussey is a web designer, creator, and marketing consultant from Canada. With his online courses & tutorials, he’s taught hundreds of thousands of web designers & developers how to get better at their craft and make a living doing work they love. As a consultant, Brad helps busy creators, coaches, and authors double their business without doubling their effort.",
    "originalPrice": 89.99,
    "discountedPrice": 79.99,
    "numOfRatings": 200,
    "rating": 4.7,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://img-c.udemycdn.com/course/240x135/446134_383c_3.jpg",
    "description": "Take your web design skills to the next level with this advanced course. Learn how to create complex and interactive websites.",
    "requirements": "A solid understanding of web design and experience working with HTML, CSS, and JavaScript.",
    "learningOutcomes": [
      "Understand advanced concepts in web design such as responsive design, CSS animations, and JavaScript frameworks",
      "Learn how to design and build complex and interactive websites",
      "Gain experience working with common web design tools and technologies",
      "Be able to optimize and debug web design code"
    ]
  },
  {
    "title": "Introduction to Data Science",
    "author": "Andrei Neagoie",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/38516954_b11c_3.jpg",
    "authorDescription": "Andrei is the instructor of some of the highest rated programming and technical courses online. He is now the founder of ZTM Academy which is one of the fastest growing education platforms in the world. ZTM Academy is known for having some of the best instructors and success rates for students. His graduates have moved on to work for some of the biggest tech companies around the world like Apple, Google, Tesla, Amazon, JP Morgan, IBM, UNIQLO etc... He has been working as a senior software developer in Silicon Valley and Toronto for many years, and is now taking all that he has learned, to teach programming skills and to help you discover the amazing career opportunities that being a developer allows in life. \n\nHaving been a self taught programmer, he understands that there is an overwhelming number of online courses, tutorials and books that are overly verbose and inadequate at teaching proper skills. Most people feel paralyzed and don't know where to start when learning a complex subject matter, or even worse, most people don't have $20,000 to spend on a coding bootcamp. Programming skills should be affordable and open to all. An education material should teach real life skills that are current and they should not waste a student's valuable time.  Having learned important lessons from working for Fortune 500 companies, tech startups, to even founding his own business, he is now dedicating 100% of his time to teaching others valuable software development skills in order to take control of their life and work in an exciting industry with infinite possibilities. \n\nAndrei promises you that there are no other courses out there as comprehensive and as well explained. He believes that in order to learn anything of value, you need to start with the foundation and develop the roots of the tree. Only from there will you be able to learn concepts and specific skills(leaves) that connect to the foundation. Learning becomes exponential when structured in this way. \n\nTaking his experience in educational psychology and coding, Andrei's courses will take you on an understanding of complex subjects that you never thought would be possible.  \n\nSee you inside the courses!\n\n",
    "originalPrice": 59.99,
    "discountedPrice": 49.99,
    "numOfRatings": 200,
    "rating": 4.5,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://img-b.udemycdn.com/course/240x135/2511476_4e38_5.jpg\n",
    "description": "Learn the basics of data science in this comprehensive course. Suitable for beginners with no prior data science experience.",
    "requirements": "A computer with internet access and a basic understanding of mathematics and statistics.",
    "learningOutcomes": [
      "Understand the fundamental concepts of data science",
      "Learn how to use data science tools to analyze and visualize data",
      "Gain experience working with common data science libraries and frameworks",
      "Be able to use data science to solve basic problems"
    ]
  },
  {
    "title": "Introduction to Network Security",
    "author": "Alton Hardin",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/10099014_e592_15.jpg",
    "authorDescription": "Alton Hardin is a former college professor and the founder and lead instructor at Alton Teaches LLC and MicroGrinder Poker School, as well as a best-selling author. He holds two graduate degrees, a Master’s of Business Administration (MBA) with a specialization in Information Assurance and Security Management, and a Master’s of Science (MS) in Information Technology Network Management. He has multiple IT industry certifications, including the Certified Information Systems Security Professional (CISSP #740196), ITIL, Security+, Network+, Project+, eLearnSecurity Junior Penetration Tester (eJPT), and several other certifications.\n\nAlton has worked in information technology since 1999 and spent the last 12 years as a Cybersecurity specialist at the United States Department of Treasury before transitioning to teaching IT full-time. Alton also has a fond love for teaching. As an undergraduate, he group tutored chemistry students, and as a graduate student, he taught a GMAT prep course. Upon graduating from his MBA program, he began teaching as an adjunct professor for the School of Business & Public Administration at his local state university in the field of Information Systems and IT Management.\n\nHe is also the founder of MicroGrinder Poker School, an online poker school dedicated to micro stakes poker players, where he provides a wide array of free and low-cost poker resources and poker training, including poker strategy articles and poker training video series. He is also the Amazon #1 best-selling author of Essential Poker Math, Expanded Edition.",
    "originalPrice": 69.99,
    "discountedPrice": 59.99,
    "numOfRatings": 150,
    "rating": 4.6,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://img-c.udemycdn.com/course/240x135/580876_a07a_2.jpg",
    "description": "Learn the basics of network security in this comprehensive course. Suitable for beginners with no prior network security experience.",
    "requirements": "A computer with internet access and a basic understanding of computer networks and security.",
    "learningOutcomes": [
      "Understand the fundamental concepts of network security",
      "Learn how to secure networks and protect data",
      "Gain experience working with common network security tools and technologies",
      "Be able to apply network security best practices to protect against cyber threats"
    ]
  },
  {
    "title": "Introduction to Cloud Computing",
    "author": "Mohammed Rhim",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/73216018_428a.jpg",
    "authorDescription": "Hi, my name's Mohamed Rahim.\n\nI am Telecom Engineer graduated from Higher School of Communication of Tunis since 2009.\n\nI acquired during 11 years of professional experience under one of the biggest Telecom provider in my country a good expertise in the areas of networks, virtualization, storage, windows system, Cloud Computing, security ...\n\nI am certified VMware VCP-510 which confirm my expertise in the virtualization field.\n\nAlso I am certified CCSK (cloud computing security knowledge) from the Cloud Security Alliance CSA.\n\nI worked on several products CISCO, IBM, HUAWEI, VMware, Hyper-v, Microsoft System Center...\n\nSince 2 years and as Freelance Instructor I am giving courses on  Cloud Computing Solution based on Openstack.\n\nDuring my spare time I enjoy football and playing Chess.\n\nPlease feel free to ask me any question concerning the topics of my courses.",
    "originalPrice": 79.99,
    "discountedPrice": 69.99,
    "numOfRatings": 100,
    "rating": 4.2,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://img-c.udemycdn.com/course/240x135/3619962_381c_4.jpg",
    "description": "Learn the basics of cloud computing in this comprehensive course. Suitable for beginners with no prior cloud computing experience.",
    "requirements": "A computer with internet access and a basic understanding of computer networks and data storage.",
    "learningOutcomes": [
      "Understand the fundamental concepts of cloud computing",
      "Learn how to use cloud-based solutions to store and manage data",
      "Gain experience working with common cloud computing platforms and technologies",
      "Be able to use cloud computing to solve basic problems"
    ]
  },
  {
    "title": "Introduction to Python",
    "author": "Dr.Angela Yu\n",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/31334738_a13c_3.jpg",
    "authorDescription": "I'm Angela, I'm a developer with a passion for teaching. I'm the lead instructor at the London App Brewery, London's leading Programming Bootcamp. I've helped hundreds of thousands of students learn to code and change their lives by becoming a developer. I've been invited by companies such as Twitter, Facebook and Google to teach their employees.\n\nMy first foray into programming was when I was just 12 years old, wanting to build my own Space Invader game. Since then, I've made hundred of websites, apps and games. But most importantly, I realised that my greatest passion is teaching.\n\nI spend most of my time researching how to make learning to code fun and make hard concepts easy to understand. I apply everything I discover into my bootcamp courses. In my courses, you'll find lots of geeky humour but also lots of explanations and animations to make sure everything is easy to understand.\n\nI'll be there for you every step of the way.",
    "originalPrice": 49.99,
    "discountedPrice": 39.99,
    "numOfRatings": 170891,
    "rating": 4.5,
    "level": "Beginner",
    "isBestSeller": true,
    "isHot": false,
    "thumbnail": "https://img-c.udemycdn.com/course/240x135/2776760_f176_10.jpg",
    "description": "Master Python by building 100 projects in 100 days. Learn data science, automation, build websites, games and apps!",
    "requirements": "A computer with internet access and a basic understanding of computer use.",
    "learningOutcomes": [
      "You will master the Python programming language by building 100 unique projects over 100 days.",
      "You will be able to program in Python professionally",
      "Create a portfolio of 100 Python projects to apply for developer jobs",
      "Be able to use Python for data science and machine learning",
      "Build GUIs and Desktop applications with Python",
      "You will learn automation, game, app and web development, data science and machine learning all using Python.",
      "You will learn Selenium, Beautiful Soup, Request, Flask, Pandas, NumPy, Scikit Learn, Plotly, and Matplotlib.",
      "Be able to build fully fledged websites and web apps with Python",
      "Build games like Blackjack, Pong and Snake using Python"
    ]
  },
  {
    "title": "Web Design for Beginners",
    "author": "Jerome Morales\n",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/99097650_4e5f.jpg",
    "authorDescription": "Jerome Morales is an IT professional who has been in the industry for more than a decade, he has a variety of unique experiences in information technology that involves software development, system administration, graphics design as well as providing technical education and training. He is a Microsoft Certified Professional, Microsoft Certified Technology Specialist, and a Microsoft Certified Solutions Associate.",
    "originalPrice": 59.99,
    "discountedPrice": 49.99,
    "numOfRatings": 150,
    "rating": 4.6,
    "level": "Beginner",
    "isBestSeller": true,
    "isHot": false,
    "thumbnail": "https://img-b.udemycdn.com/course/240x135/3688830_1dae_3.jpg\n",
    "description": "Learn the basics of web design in this comprehensive course. Suitable for beginners with no prior web design experience.",
    "requirements": "A computer with internet access and a basic understanding of HTML and CSS.",
    "learningOutcomes": [
      "Understand the fundamental concepts of web design",
      "Learn how to create beautiful and responsive websites using HTML, CSS, and JavaScript",
      "Gain experience working with common web design tools and technologies",
      "Be able to design and build your own website"
    ]
  },
  {
    "title": "JavaScript for Beginners",
    "author": "Jonas Schetdmann",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/7799204_2091_5.jpg",
    "authorDescription": "Hi, I'm Jonas! I have been identified as one of Udemy's Top Instructors and all my premium courses have earned the best-selling status for outstanding performance and student satisfaction.\n\nI'm a full-stack web developer and designer with a passion for building beautiful things from scratch. I've been building websites and apps since 2010 and also have a Master's degree in Engineering.\n\nI discovered my passion for teaching and helping others by sharing all I knew when I was in college, and that passion brought me to Udemy in 2015.\n\nHere, in all my courses, what students love the most is that I take the time to explain every concept in a way that everyone can easily understand.\n\nSo, do you want to learn how to build awesome websites with modern HTML and CSS?\n\nLooking for a complete JavaScript course that takes you from zero to an advanced developer?\n\nOr maybe you want to build modern and fast back-end applications with Node.js?\n\nThen don't waste your time with random tutorials or incomplete youtube videos. All my courses are easy-to-follow, all-in-one packages that will take your skills to the next level.\n\nThese courses are exactly the courses I wish I had when I was first getting into web development!\n\nSo see for yourself, enroll in one of my courses (or all of them :D) and join 1,000,000+ happy students today.",
    "originalPrice": 39.99,
    "discountedPrice": 29.99,
    "numOfRatings": 26491,
    "rating": 4.2,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://img-c.udemycdn.com/course/480x270/2508942_11d3_3.jpg",
    "description": "Learn the basics of JavaScript programming in this comprehensive course. Suitable for beginners with no prior programming experience.",
    "requirements": "A computer with internet access and a basic understanding of HTML and CSS.",
    "learningOutcomes": [
      "Understand the fundamental concepts of programming using JavaScript",
      "Learn how to write basic JavaScript scripts",
      "Gain experience working with common JavaScript data types and structures",
      "Be able to use JavaScript to create interactive web pages and dynamic user interfaces"
    ]
  },
  {
    "title": "Advanced Network Security",
    "author": "Jason Wood",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/8806284_f392_2.jpg",
    "authorDescription": "Jason Wood is an expert in cybersecurity, network security and testing the security of networks and websites.  He has spent years as a consultant breaking the cybersecurity controls of his clients and showing them how to fix vulnerabilities.  He has been in cybersecurity and information technology for over 15 years.  Jason enjoys presenting on security topics at conferences and in classes.  He has taught classes on penetration testing, security operations and vulnerability assessments.\n\nIn his free time, Jason enjoys giving back to his community by working with teenagers as a CyberPatriot mentor and a member of the Civil Air Patrol. The enthusiasm of these young men and women keeps him fired up as they learn about computer security, service and leadership.",
    "originalPrice": 109.99,
    "discountedPrice": 99.99,
    "numOfRatings": 200,
    "rating": 4.7,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://img-c.udemycdn.com/course/240x135/723508_8fcc_5.jpg\n",
    "description": "Take your network security skills to the next level with this advanced course. Learn how to secure enterprise networks.",
    "requirements": "A solid understanding of network security and experience working with network security tools and technologies.",
    "learningOutcomes": [
      "Understand advanced concepts in network security such as intrusion detection and prevention, and secure network architecture",
      "Learn how to design and implement secure enterprise networks",
      "Gain experience working with common network security tools and technologies",
      "Be able to troubleshoot and remediate network security issues"
    ]
  },
  {
    "title": "Advanced Cloud Computing",
    "author": "Stephane Marek",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/16122994_284f_18.jpg",
    "authorDescription": "Stéphane is recognized as an AWS Hero and is an AWS Certified Solutions Architect Professional & AWS Certified DevOps Professional. He loves to teach people how to use the AWS properly, to get them ready for their AWS certifications, and most importantly for the real world.\n\nHe also loves Apache Kafka. He sits on the 2019 Program Committee organizing the Kafka Summit in New York, London and San Francisco. He is also an active member of the Apache Kafka community, authoring blogs on Medium and a guest blog for Confluent.  \n\nDuring his spare time he enjoys cooking, practicing yoga, surfing, watching TV shows, and traveling to awesome destinations!",
    "originalPrice": 129.99,
    "discountedPrice": 109.99,
    "numOfRatings": 250,
    "rating": 4.9,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://img-b.udemycdn.com/course/240x135/2789348_065c_4.jpg",
    "description": "Take your cloud computing skills to the next level with this advanced course. Learn how to build and manage advanced cloud-based solutions.",
    "requirements": "A solid understanding of cloud computing and experience working with cloud-based solutions.",
    "learningOutcomes": [
      "Understand advanced concepts in cloud computing such as cloud security, and containerization",
      "Learn how to design and implement advanced cloud-based solutions",
      "Gain experience working with common cloud computing platforms and technologies",
      "Be able to troubleshoot and optimize cloud computing solutions"
    ]
  },
  {
    "title": "Introduction to Cyber Security",
    "author": "Rick Crisci",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/26453858_78c2.jpg",
    "authorDescription": "I am the owner of TrainerTests and have delivered thousands of hours of official live training to my students, and I love teaching people new skills.\n\nI provide video training unlike any other organization. I believe in using high quality illustrations and animations to simply complex concepts. In my courses you will get the technical depth that you need, with a focus on making sure that you completely understand the underlying concepts.\n\nPlease feel free to connect with me on LinkedIn, I always enjoy making new contacts with my students!",
    "originalPrice": 59.99,
    "discountedPrice": 49.99,
    "numOfRatings": 150,
    "rating": 4.6,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://img-c.udemycdn.com/course/480x270/4328166_0767_3.jpg",
    "description": "Learn the basics of cyber security in this comprehensive course. Suitable for beginners with no prior cyber security experience.",
    "requirements": "A computer with internet access and a basic understanding of computer networks and security.",
    "learningOutcomes": [
      "Understand the fundamental concepts of cyber security",
      "Learn how to protect networks and data from cyber threats",
      "Gain experience working with common cyber security tools and technologies",
      "Be able to apply cyber security best practices to protect against cyber threats"
    ]
  },
  {
    "title": "Advanced Python",
    "author": "Ardit Sulce\n",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/717783_3157_8.jpg",
    "authorDescription": "Hi, I am Ardit! I am a Python programmer, teacher, and founder of PythonHow. I graduated in 2013 with a Master of Science in Geospatial Technologies from the University of Muenster in Germany with a focus on using Python for remote sensing.\n\nI have worked with companies from various countries, such as the Center for Conservation Geography, to map and understand Australian ecosystems, image processing with the Swiss in-Terra, and performing data mining to gain business insights with the Australian Rapid Intelligence.\n\nIf you want to learn Python through my courses, I propose the following learning path: Start with The Python Mega Course 2022: Build 10 Real-World Applications. Students love that course as a comprehensive real-world guide to Python and building programs with Python. After finishing that course, take my Automate Everything with Python course if you want to use Python to make small-to-medium programs. That course contains everything you need to start using Python as your swiss army knife. On the other hand, if you are interested in making large applications, my advanced course Advanced Python: Python OOP with 10 Real-World Programs would be a better choice. All the courses are listed here on my Udemy profile page.",
    "originalPrice": 99.99,
    "discountedPrice": 79.99,
    "numOfRatings": 150,
    "rating": 4.8,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://img-b.udemycdn.com/course/240x135/2563788_0ef3_21.jpg",
    "description": "Master Python from the inside out and learn how to build any Python program with ease using Python classes and OOP!",
    "requirements": "A solid understanding of Python programming and experience working with Python.",
    "learningOutcomes": [
      "Escape the world of Python basics and take your Python skills to a professional level.",
      "Build 10 real-world Python programs using the professional object-oriented programming approach",
      "Learn how to plan your Python programs before writing them.",
      "Learn and apply software design principles when programming in Python.",
      "Learn to polish your Python programs to make them ready for users to use."
    ]
  },
  {
    "title": "Advanced Machine Learning",
    "author": "Dr. John Kron",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/90947184_50db.jpg",
    "authorDescription": "on Krohn is Chief Data Scientist at the machine learning company untapt. He authored the book Deep Learning Illustrated, an instant #1 bestseller that was translated into six languages.\n\nJon is renowned for his compelling lectures, which he offers in-person at Columbia University and New York University, as well as online via O'Reilly and the SuperDataScience podcast.\n\nHe holds a PhD from Oxford and has been publishing on machine learning in leading academic journals since 2010; his papers have been cited over a thousand times.",
    "originalPrice": 129.99,
    "discountedPrice": 109.99,
    "numOfRatings": 300,
    "rating": 4.9,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://img-b.udemycdn.com/course/240x135/3501832_8dbc_3.jpg",
    "description": "Take your machine learning skills to the next level with this advanced course. Learn how to build advanced machine learning models.",
    "requirements": "A solid understanding of machine learning and experience working with machine learning algorithms.",
    "learningOutcomes": [
      "Understand advanced concepts in machine learning such as deep learning and natural language processing",
      "Learn how to design and build advanced machine learning models",
      "Gain experience working with common machine learning libraries and frameworks",
      "Be able to optimize and debug machine learning code"
    ]
  },
  {
    "title": "Introduction to Machine Learning",
    "author": "Kiril Eremenko",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/2364054_83cd_5.jpg",
    "authorDescription": "My name is Kirill Eremenko and I am super-psyched that you are reading this!\n\nProfessionally, I come from the Data Science consulting space with experience in finance, retail, transport and other industries. I was trained by the best analytics mentors at Deloitte Australia and since starting on Udemy I have passed on my knowledge to thousands of aspiring data scientists.\n\nFrom my courses you will straight away notice how I combine my real-life experience and academic background in Physics and Mathematics to deliver professional step-by-step coaching in the space of Data Science. One of the strongest sides of my teaching style is that I focus on intuitive explanations, so you can be sure that you will truly understand even the most complex topics.\n\nTo sum up, I am absolutely and utterly passionate about Data Science and I am looking forward to sharing my passion and knowledge with you!",
    "originalPrice": 69.99,
    "discountedPrice": 59.99,
    "numOfRatings": 100,
    "rating": 4.3,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://img-c.udemycdn.com/course/240x135/950390_270f_3.jpg",
    "description": "Learn the basics of machine learning in this comprehensive course. Suitable for beginners with no prior machine learning experience.",
    "requirements": "A computer with internet access and a basic understanding of mathematics and statistics.",
    "learningOutcomes": [
      "Understand the fundamental concepts of machine learning",
      "Learn how to use machine learning algorithms to make predictions",
      "Gain experience working with common machine learning tools and technologies",
      "Be able to use machine learning to solve basic problems"
    ]
  },
  {
    "title": "Advanced Data Science",
    "author": "Kirill Eremenko",
    "authorImage": "https://img-c.udemycdn.com/user/200_H/2364054_83cd_5.jpg",
    "authorDescription": "My name is Kirill Eremenko and I am super-psyched that you are reading this!\n\nProfessionally, I come from the Data Science consulting space with experience in finance, retail, transport and other industries. I was trained by the best analytics mentors at Deloitte Australia and since starting on Udemy I have passed on my knowledge to thousands of aspiring data scientists.\n\nFrom my courses you will straight away notice how I combine my real-life experience and academic background in Physics and Mathematics to deliver professional step-by-step coaching in the space of Data Science. One of the strongest sides of my teaching style is that I focus on intuitive explanations, so you can be sure that you will truly understand even the most complex topics.\n\nTo sum up, I am absolutely and utterly passionate about Data Science and I am looking forward to sharing my passion and knowledge with you!",
    "originalPrice": 99.99,
    "discountedPrice": 89.99,
    "numOfRatings": 250,
    "rating": 4.8,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://img-b.udemycdn.com/course/240x135/946194_028d_6.jpg",
    "description": "Take your data science skills to the next level with this advanced course. Learn how to build advanced data models.",
    "requirements": "A solid understanding of data science and experience working with data analysis and visualization.",
    "learningOutcomes": [
      "Understand advanced concepts in data science such as big data and data mining",
      "Learn how to design and build advanced data models",
      "Gain experience working with common data science libraries and frameworks",
      "Be able to optimize and debug data science code"
    ]
  }
]
