[
  {
    "title": "Introduction to Python",
    "author": "John Doe",
    "authorImage": "https://example.com/john-doe.jpg",
    "authorDescription": "John Doe is a software engineer with over 10 years of experience in Python development.",
    "originalPrice": 49.99,
    "discountedPrice": 39.99,
    "numOfRatings": 200,
    "rating": 4.5,
    "level": "Beginner",
    "isBestSeller": true,
    "isHot": false,
    "thumbnail": "https://example.com/python-thumbnail.jpg",
    "description": "Learn the basics of Python programming in this comprehensive course. Suitable for beginners with no prior programming experience.",
    "requirements": "A computer with internet access and a basic understanding of computer use.",
    "learningOutcomes": [
      "Understand the fundamental concepts of programming using Python",
      "Learn how to write basic Python scripts",
      "Gain experience working with common Python data types and structures",
      "Be able to use Python to solve basic problems"
    ]
  },
  {
    "title": "Advanced Python",
    "author": "Jane Smith",
    "authorImage": "https://example.com/jane-smith.jpg",
    "authorDescription": "Jane Smith is a senior software engineer with extensive experience in building large-scale Python applications.",
    "originalPrice": 99.99,
    "discountedPrice": 79.99,
    "numOfRatings": 150,
    "rating": 4.8,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://example.com/advanced-python-thumbnail.jpg",
    "description": "Take your Python skills to the next level with this advanced course. Learn how to build large-scale Python applications.",
    "requirements": "A solid understanding of Python programming and experience working with Python.",
    "learningOutcomes": [
      "Understand advanced concepts in Python such as object-oriented programming and decorators",
      "Learn how to design and build large-scale Python applications",
      "Gain experience working with common Python libraries and frameworks",
      "Be able to optimize and debug Python code"
    ]
  },
  {
    "title": "JavaScript for Beginners",
    "author": "John Doe",
    "authorImage": "https://example.com/john-doe.jpg",
    "authorDescription": "John Doe is a software engineer with over 10 years of experience in JavaScript development.",
    "originalPrice": 39.99,
    "discountedPrice": 29.99,
    "numOfRatings": 100,
    "rating": 4.2,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://example.com/javascript-thumbnail.jpg",
    "description": "Learn the basics of JavaScript programming in this comprehensive course. Suitable for beginners with no prior programming experience.",
    "requirements": "A computer with internet access and a basic understanding of HTML and CSS.",
    "learningOutcomes": [
      "Understand the fundamental concepts of programming using JavaScript",
      "Learn how to write basic JavaScript scripts",
      "Gain experience working with common JavaScript data types and structures",
      "Be able to use JavaScript to create interactive web pages and dynamic user interfaces"
    ]
  },
  {
    "title": "Advanced JavaScript",
    "author": "Jane Smith",
    "authorImage": "https://example.com/jane-smith.jpg",
    "authorDescription": "Jane Smith is a senior software engineer with extensive experience in building large-scale JavaScript applications.",
    "originalPrice": 119.99,
    "discountedPrice": 99.99,
    "numOfRatings": 250,
    "rating": 4.9,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://example.com/advanced-javascript-thumbnail.jpg",
    "description": "Take your JavaScript skills to the next level with this advanced course. Learn how to build large-scale JavaScript applications.",
    "requirements": "A solid understanding of JavaScript programming and experience working with JavaScript.",
    "learningOutcomes": [
      "Understand advanced concepts in JavaScript such as closures, prototypes, and async programming",
      "Learn how to design and build large-scale JavaScript applications",
      "Gain experience working with common JavaScript libraries and frameworks",
      "Be able to optimize and debug JavaScript code"
    ]
  },
  {
    "title": "Web Design for Beginners",
    "author": "John Doe",
    "authorImage": "https://example.com/john-doe.jpg",
    "authorDescription": "John Doe is a web designer with over 10 years of experience in creating beautiful and responsive websites.",
    "originalPrice": 59.99,
    "discountedPrice": 49.99,
    "numOfRatings": 150,
    "rating": 4.6,
    "level": "Beginner",
    "isBestSeller": true,
    "isHot": false,
    "thumbnail": "https://example.com/web-design-thumbnail.jpg",
    "description": "Learn the basics of web design in this comprehensive course. Suitable for beginners with no prior web design experience.",
    "requirements": "A computer with internet access and a basic understanding of HTML and CSS.",
    "learningOutcomes": [
      "Understand the fundamental concepts of web design",
      "Learn how to create beautiful and responsive websites using HTML, CSS, and JavaScript",
      "Gain experience working with common web design tools and technologies",
      "Be able to design and build your own website"
    ]
  },
  {
    "title": "Advanced Web Design",
    "author": "Jane Smith",
    "authorImage": "https://example.com/jane-smith.jpg",
    "authorDescription": "Jane Smith is a senior web designer with extensive experience in creating complex and interactive websites.",
    "originalPrice": 89.99,
    "discountedPrice": 79.99,
    "numOfRatings": 200,
    "rating": 4.7,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://example.com/advanced-web-design-thumbnail.jpg",
    "description": "Take your web design skills to the next level with this advanced course. Learn how to create complex and interactive websites.",
    "requirements": "A solid understanding of web design and experience working with HTML, CSS, and JavaScript.",
    "learningOutcomes": [
      "Understand advanced concepts in web design such as responsive design, CSS animations, and JavaScript frameworks",
      "Learn how to design and build complex and interactive websites",
      "Gain experience working with common web design tools and technologies",
      "Be able to optimize and debug web design code"
    ]
  },
  {
    "title": "Introduction to Machine Learning",
    "author": "John Doe",
    "authorImage": "https://example.com/john-doe.jpg",
    "authorDescription": "John Doe is a data scientist with over 10 years of experience in machine learning and artificial intelligence.",
    "originalPrice": 69.99,
    "discountedPrice": 59.99,
    "numOfRatings": 100,
    "rating": 4.3,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://example.com/machine-learning-thumbnail.jpg",
    "description": "Learn the basics of machine learning in this comprehensive course. Suitable for beginners with no prior machine learning experience.",
    "requirements": "A computer with internet access and a basic understanding of mathematics and statistics.",
    "learningOutcomes": [
      "Understand the fundamental concepts of machine learning",
      "Learn how to use machine learning algorithms to make predictions",
      "Gain experience working with common machine learning tools and technologies",
      "Be able to use machine learning to solve basic problems"
    ]
  },
  {
    "title": "Advanced Machine Learning",
    "author": "Jane Smith",
    "authorImage": "https://example.com/jane-smith.jpg",
    "authorDescription": "Jane Smith is a senior data scientist with extensive experience in building advanced machine learning models.",
    "originalPrice": 129.99,
    "discountedPrice": 109.99,
    "numOfRatings": 300,
    "rating": 4.9,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://example.com/advanced-machine-learning-thumbnail.jpg",
    "description": "Take your machine learning skills to the next level with this advanced course. Learn how to build advanced machine learning models.",
    "requirements": "A solid understanding of machine learning and experience working with machine learning algorithms.",
    "learningOutcomes": [
      "Understand advanced concepts in machine learning such as deep learning and natural language processing",
      "Learn how to design and build advanced machine learning models",
      "Gain experience working with common machine learning libraries and frameworks",
      "Be able to optimize and debug machine learning code"
    ]
  },
  {
    "title": "Introduction to Data Science",
    "author": "John Doe",
    "authorImage": "https://example.com/john-doe.jpg",
    "authorDescription": "John Doe is a data scientist with over 10 years of experience in data analysis and visualization.",
    "originalPrice": 59.99,
    "discountedPrice": 49.99,
    "numOfRatings": 200,
    "rating": 4.5,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://example.com/data-science-thumbnail.jpg",
    "description": "Learn the basics of data science in this comprehensive course. Suitable for beginners with no prior data science experience.",
    "requirements": "A computer with internet access and a basic understanding of mathematics and statistics.",
    "learningOutcomes": [
      "Understand the fundamental concepts of data science",
      "Learn how to use data science tools to analyze and visualize data",
      "Gain experience working with common data science libraries and frameworks",
      "Be able to use data science to solve basic problems"
    ]
  },
  {
    "title": "Advanced Data Science",
    "author": "Jane Smith",
    "authorImage": "https://example.com/jane-smith.jpg",
    "authorDescription": "Jane Smith is a senior data scientist with extensive experience in building advanced data models.",
    "originalPrice": 99.99,
    "discountedPrice": 89.99,
    "numOfRatings": 250,
    "rating": 4.8,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://example.com/advanced-data-science-thumbnail.jpg",
    "description": "Take your data science skills to the next level with this advanced course. Learn how to build advanced data models.",
    "requirements": "A solid understanding of data science and experience working with data analysis and visualization.",
    "learningOutcomes": [
      "Understand advanced concepts in data science such as big data and data mining",
      "Learn how to design and build advanced data models",
      "Gain experience working with common data science libraries and frameworks",
      "Be able to optimize and debug data science code"
    ]
  },
  {
    "title": "Introduction to Network Security",
    "author": "John Doe",
    "authorImage": "https://example.com/john-doe.jpg",
    "authorDescription": "John Doe is a network security expert with over 10 years of experience in protecting networks and data.",
    "originalPrice": 69.99,
    "discountedPrice": 59.99,
    "numOfRatings": 150,
    "rating": 4.6,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://example.com/network-security-thumbnail.jpg",
    "description": "Learn the basics of network security in this comprehensive course. Suitable for beginners with no prior network security experience.",
    "requirements": "A computer with internet access and a basic understanding of computer networks and security.",
    "learningOutcomes": [
      "Understand the fundamental concepts of network security",
      "Learn how to secure networks and protect data",
      "Gain experience working with common network security tools and technologies",
      "Be able to apply network security best practices to protect against cyber threats"
    ]
  },
  {
    "title": "Advanced Network Security",
    "author": "Jane Smith",
    "authorImage": "https://example.com/jane-smith.jpg",
    "authorDescription": "Jane Smith is a senior network security expert with extensive experience in securing enterprise networks.",
    "originalPrice": 109.99,
    "discountedPrice": 99.99,
    "numOfRatings": 200,
    "rating": 4.7,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://example.com/advanced-network-security-thumbnail.jpg",
    "description": "Take your network security skills to the next level with this advanced course. Learn how to secure enterprise networks.",
    "requirements": "A solid understanding of network security and experience working with network security tools and technologies.",
    "learningOutcomes": [
      "Understand advanced concepts in network security such as intrusion detection and prevention, and secure network architecture",
      "Learn how to design and implement secure enterprise networks",
      "Gain experience working with common network security tools and technologies",
      "Be able to troubleshoot and remediate network security issues"
    ]
  },
  {
    "title": "Introduction to Cloud Computing",
    "author": "John Doe",
    "authorImage": "https://example.com/john-doe.jpg",
    "authorDescription": "John Doe is a cloud computing expert with over 10 years of experience in building and managing cloud-based solutions.",
    "originalPrice": 79.99,
    "discountedPrice": 69.99,
    "numOfRatings": 100,
    "rating": 4.2,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://example.com/cloud-computing-thumbnail.jpg",
    "description": "Learn the basics of cloud computing in this comprehensive course. Suitable for beginners with no prior cloud computing experience.",
    "requirements": "A computer with internet access and a basic understanding of computer networks and data storage.",
    "learningOutcomes": [
      "Understand the fundamental concepts of cloud computing",
      "Learn how to use cloud-based solutions to store and manage data",
      "Gain experience working with common cloud computing platforms and technologies",
      "Be able to use cloud computing to solve basic problems"
    ]
  },
  {
    "title": "Advanced Cloud Computing",
    "author": "Jane Smith",
    "authorImage": "https://example.com/jane-smith.jpg",
    "authorDescription": "Jane Smith is a senior cloud computing expert with extensive experience in building and managing advanced cloud-based solutions.",
    "originalPrice": 129.99,
    "discountedPrice": 109.99,
    "numOfRatings": 250,
    "rating": 4.9,
    "level": "Intermediate",
    "isBestSeller": true,
    "isHot": true,
    "thumbnail": "https://example.com/advanced-cloud-computing-thumbnail.jpg",
    "description": "Take your cloud computing skills to the next level with this advanced course. Learn how to build and manage advanced cloud-based solutions.",
    "requirements": "A solid understanding of cloud computing and experience working with cloud-based solutions.",
    "learningOutcomes": [
      "Understand advanced concepts in cloud computing such as cloud security, and containerization",
      "Learn how to design and implement advanced cloud-based solutions",
      "Gain experience working with common cloud computing platforms and technologies",
      "Be able to troubleshoot and optimize cloud computing solutions"
    ]
  },
  {
    "title": "Introduction to Cyber Security",
    "author": "John Doe",
    "authorImage": "https://example.com/john-doe.jpg",
    "authorDescription": "John Doe is a cyber security expert with over 10 years of experience in protecting networks and data from cyber threats.",
    "originalPrice": 59.99,
    "discountedPrice": 49.99,
    "numOfRatings": 150,
    "rating": 4.6,
    "level": "Beginner",
    "isBestSeller": false,
    "isHot": false,
    "thumbnail": "https://example.com/cyber-security-thumbnail.jpg",
    "description": "Learn the basics of cyber security in this comprehensive course. Suitable for beginners with no prior cyber security experience.",
    "requirements": "A computer with internet access and a basic understanding of computer networks and security.",
    "learningOutcomes": [
      "Understand the fundamental concepts of cyber security",
      "Learn how to protect networks and data from cyber threats",
      "Gain experience working with common cyber security tools and technologies",
      "Be able to apply cyber security best practices to protect against cyber threats"
    ]
  }
]
